## Terraform Plan (Staging)
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloud_run.google_cloud_run_service_iam_member.api_public_access will be created
  + resource "google_cloud_run_service_iam_member" "api_public_access" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "adyela-api-staging"
    }

  # module.cloud_run.google_cloud_run_service_iam_member.web_public_access will be created
  + resource "google_cloud_run_service_iam_member" "web_public_access" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "adyela-web-staging"
    }

  # module.cloud_run.google_cloud_run_v2_service.api will be created
  + resource "google_cloud_run_v2_service" "api" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "cost-center"                = "engineering"
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "hipaa"                      = "ready"
          + "managed-by"                 = "terraform"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + labels                  = {
          + "cost-center" = "engineering"
          + "environment" = "staging"
          + "hipaa"       = "ready"
          + "managed-by"  = "terraform"
        }
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "adyela-api-staging"
      + observed_generation     = (known after apply)
      + project                 = "adyela-staging"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "cost-center"                = "engineering"
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "hipaa"                      = "ready"
          + "managed-by"                 = "terraform"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + annotations                      = {
              + "run.googleapis.com/ingress" = "internal-and-cloud-load-balancing"
            }
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-central1-docker.pkg.dev/adyela-staging/adyela/adyela-api-staging:latest"

              + env {
                  + name  = "AUDIT_LOGGING"
                  + value = "true"
                }
              + env {
                  + name  = "CORS_ORIGINS"
                  + value = "https://staging.adyela.care,https://adyela-staging.firebaseapp.com,https://adyela-staging.web.app"
                }
              + env {
                  + name  = "DATABASE_URL"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "database-connection-string"
                          + version = "1"
                        }
                    }
                }
              + env {
                  + name  = "DATA_ENCRYPTION"
                  + value = "true"
                }
              + env {
                  + name  = "ENCRYPTION_KEY"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "encryption-key"
                          + version = "1"
                        }
                    }
                }
              + env {
                  + name  = "ENVIRONMENT"
                  + value = "staging"
                }
              + env {
                  + name  = "EXTERNAL_API_KEYS"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "external-api-keys"
                          + version = "1"
                        }
                    }
                }
              + env {
                  + name  = "FIREBASE_ADMIN_KEY"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "firebase-admin-key"
                          + version = "1"
                        }
                    }
                }
              + env {
                  + name  = "FIREBASE_PROJECT_ID"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "firebase-project-id"
                          + version = "1"
                        }
                    }
                }
              + env {
                  + name  = "GCP_PROJECT_ID"
                  + value = "adyela-staging"
                }
              + env {
                  + name  = "HIPAA_COMPLIANCE"
                  + value = "true"
                }
              + env {
                  + name  = "JWT_SECRET"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "jwt-secret-key"
                          + version = "1"
                        }
                    }
                }
              + env {
                  + name  = "SECRET_KEY"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "api-secret-key"
                          + version = "1"
                        }
                    }
                }
              + env {
                  + name  = "SMTP_CREDENTIALS"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "smtp-credentials"
                          + version = "1"
                        }
                    }
                }
              + env {
                  + name  = "VERSION"
                  + value = "latest"
                }

              + ports {
                  + container_port = 8000
                  + name           = (known after apply)
                }

              + resources {
                  + limits = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                }

              + startup_probe (known after apply)
            }

          + scaling {
              + max_instance_count = 2
              + min_instance_count = 0
            }

          + vpc_access {
              + connector = "projects/adyela-staging/locations/us-central1/connectors/adyela-staging-connector"
              + egress    = "PRIVATE_RANGES_ONLY"
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # module.cloud_run.google_cloud_run_v2_service.web will be created
  + resource "google_cloud_run_v2_service" "web" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "cost-center"                = "engineering"
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "hipaa"                      = "ready"
          + "managed-by"                 = "terraform"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + labels                  = {
          + "cost-center" = "engineering"
          + "environment" = "staging"
          + "hipaa"       = "ready"
          + "managed-by"  = "terraform"
        }
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "adyela-web-staging"
      + observed_generation     = (known after apply)
      + project                 = "adyela-staging"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "cost-center"                = "engineering"
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "hipaa"                      = "ready"
          + "managed-by"                 = "terraform"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + template {
          + annotations                      = {
              + "run.googleapis.com/ingress" = "internal-and-cloud-load-balancing"
            }
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = "adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-central1-docker.pkg.dev/adyela-staging/adyela/adyela-web-staging:latest"

              + env {
                  + name  = "AUDIT_LOGGING"
                  + value = "true"
                }
              + env {
                  + name  = "HIPAA_COMPLIANCE"
                  + value = "true"
                }
              + env {
                  + name  = "VERSION"
                  + value = "latest"
                }
              + env {
                  + name  = "VITE_API_URL"
                  + value = "https://staging.adyela.care"
                }
              + env {
                  + name  = "VITE_ENV"
                  + value = "staging"
                }
              + env {
                  + name  = "VITE_FIREBASE_API_KEY"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "firebase-web-api-key"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "VITE_FIREBASE_APP_ID"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "firebase-web-app-id"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "VITE_FIREBASE_AUTH_DOMAIN"
                  + value = "adyela-staging.firebaseapp.com"
                }
              + env {
                  + name  = "VITE_FIREBASE_MESSAGING_SENDER_ID"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "firebase-messaging-sender-id"
                          + version = "latest"
                        }
                    }
                }
              + env {
                  + name  = "VITE_FIREBASE_PROJECT_ID"
                  + value = "adyela-staging"
                }
              + env {
                  + name  = "VITE_FIREBASE_STORAGE_BUCKET"
                  + value = "adyela-staging.appspot.com"
                }
              + env {
                  + name  = "VITE_JITSI_DOMAIN"
                  + value = "meet.jit.si"
                }

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources {
                  + limits = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                }

              + startup_probe (known after apply)
            }

          + scaling {
              + max_instance_count = 2
              + min_instance_count = 0
            }

          + vpc_access {
              + connector = "projects/adyela-staging/locations/us-central1/connectors/adyela-staging-connector"
              + egress    = "PRIVATE_RANGES_ONLY"
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # module.identity_platform.google_identity_platform_config.default will be created
  + resource "google_identity_platform_config" "default" {
      + authorized_domains = [
          + "localhost",
          + "staging.adyela.care",
          + "adyela-staging.firebaseapp.com",
          + "adyela-staging.web.app",
        ]
      + id                 = (known after apply)
      + name               = (known after apply)
      + project            = "adyela-staging"

      + client {
          + api_key            = (sensitive value)
          + firebase_subdomain = (known after apply)

          + permissions {
              + disabled_user_deletion = false
              + disabled_user_signup   = false
            }
        }

      + mfa {
          + enabled_providers = [
              + "PHONE_SMS",
            ]
          + state             = "ENABLED"
        }

      + monitoring (known after apply)

      + sign_in {
          + allow_duplicate_emails = false
          + hash_config            = (known after apply)

          + anonymous {
              + enabled = false
            }

          + email {
              + enabled           = true
              + password_required = true
            }
        }

      + sms_region_config (known after apply)
    }

  # module.identity_platform.google_identity_platform_default_supported_idp_config.google[0] will be created
  + resource "google_identity_platform_default_supported_idp_config" "google" {
      + client_id     = (sensitive value)
      + client_secret = (sensitive value)
      + enabled       = true
      + id            = (known after apply)
      + idp_id        = "google.com"
      + name          = (known after apply)
      + project       = "adyela-staging"
    }

  # module.identity_platform.google_identity_platform_default_supported_idp_config.microsoft[0] will be created
  + resource "google_identity_platform_default_supported_idp_config" "microsoft" {
      + client_id     = (sensitive value)
      + client_secret = (sensitive value)
      + enabled       = true
      + id            = (known after apply)
      + idp_id        = "microsoft.com"
      + name          = (known after apply)
      + project       = "adyela-staging"
    }

  # module.identity_platform.google_identity_platform_tenant.default[0] will be created
  + resource "google_identity_platform_tenant" "default" {
      + allow_password_signup    = true
      + display_name             = "Adyela Healthcare Platform - Staging"
      + enable_email_link_signin = false
      + id                       = (known after apply)
      + name                     = (known after apply)
      + project                  = "adyela-staging"
    }

  # module.identity_platform.google_project_iam_audit_config.identity_platform_audit[0] will be created
  + resource "google_project_iam_audit_config" "identity_platform_audit" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + project = "adyela-staging"
      + service = "identitytoolkit.googleapis.com"

      + audit_log_config {
          + exempted_members = []
          + log_type         = "ADMIN_READ"
        }
      + audit_log_config {
          + exempted_members = []
          + log_type         = "DATA_READ"
        }
      + audit_log_config {
          + exempted_members = []
          + log_type         = "DATA_WRITE"
        }
    }

  # module.identity_platform.google_project_iam_member.identity_platform_admin will be created
  + resource "google_project_iam_member" "identity_platform_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:identity-platform-api-staging@adyela-staging.iam.gserviceaccount.com"
      + project = "adyela-staging"
      + role    = "roles/firebaseauth.admin"
    }

  # module.identity_platform.google_project_iam_member.identity_platform_viewer will be created
  + resource "google_project_iam_member" "identity_platform_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:identity-platform-api-staging@adyela-staging.iam.gserviceaccount.com"
      + project = "adyela-staging"
      + role    = "roles/firebaseauth.viewer"
    }

  # module.identity_platform.google_project_service.identity_platform will be created
  + resource "google_project_service" "identity_platform" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "adyela-staging"
      + service            = "identityplatform.googleapis.com"
    }

  # module.identity_platform.google_project_service.identity_toolkit will be created
  + resource "google_project_service" "identity_toolkit" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "adyela-staging"
      + service            = "identitytoolkit.googleapis.com"
    }

  # module.identity_platform.google_service_account.identity_platform_api will be created
  + resource "google_service_account" "identity_platform_api" {
      + account_id   = "identity-platform-api-staging"
      + description  = "Service account for Identity Platform API authentication and token verification"
      + disabled     = false
      + display_name = "Identity Platform API Service Account - Staging"
      + email        = "identity-platform-api-staging@adyela-staging.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:identity-platform-api-staging@adyela-staging.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "adyela-staging"
      + unique_id    = (known after apply)
    }

  # module.identity_platform.google_service_account_key.identity_platform_api will be created
  + resource "google_service_account_key" "identity_platform_api" {
      + id                 = (known after apply)
      + key_algorithm      = "KEY_ALG_RSA_2048"
      + name               = (known after apply)
      + private_key        = (sensitive value)
      + private_key_type   = "TYPE_GOOGLE_CREDENTIALS_FILE"
      + public_key         = (known after apply)
      + public_key_type    = "TYPE_X509_PEM_FILE"
      + service_account_id = (known after apply)
      + valid_after        = (known after apply)
      + valid_before       = (known after apply)
    }

  # module.load_balancer.google_compute_backend_bucket.static_backend will be created
  + resource "google_compute_backend_bucket" "static_backend" {
      + bucket_name        = "adyela-staging-static-assets"
      + creation_timestamp = (known after apply)
      + enable_cdn         = true
      + id                 = (known after apply)
      + name               = "adyela-staging-static-backend"
      + project            = "adyela-staging"
      + self_link          = (known after apply)

      + cdn_policy {
          + cache_mode         = "CACHE_ALL_STATIC"
          + client_ttl         = 31536000
          + default_ttl        = 86400
          + max_ttl            = 31536000
          + negative_caching   = true
          + request_coalescing = true
          + serve_while_stale  = 86400
        }
    }

  # module.load_balancer.google_compute_backend_service.api_backend will be created
  + resource "google_compute_backend_service" "api_backend" {
      + affinity_cookie_ttl_sec         = 3600
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + description                     = "Backend service for staging API"
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "adyela-staging-api-backend"
      + port_name                       = "http"
      + project                         = "adyela-staging"
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = "GENERATED_COOKIE"
      + timeout_sec                     = 30

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
            # (2 unchanged attributes hidden)
        }

      + cdn_policy (known after apply)

      + iap (known after apply)

      + log_config {
          + enable        = true
          + optional_mode = (known after apply)
          + sample_rate   = 1
        }
    }

  # module.load_balancer.google_compute_backend_service.web_backend will be created
  + resource "google_compute_backend_service" "web_backend" {
      + affinity_cookie_ttl_sec         = 3600
      + connection_draining_timeout_sec = 300
      + creation_timestamp              = (known after apply)
      + description                     = "Backend service for staging web application"
      + fingerprint                     = (known after apply)
      + generated_id                    = (known after apply)
      + id                              = (known after apply)
      + load_balancing_scheme           = "EXTERNAL"
      + name                            = "adyela-staging-web-backend"
      + port_name                       = "http"
      + project                         = "adyela-staging"
      + protocol                        = "HTTP"
      + self_link                       = (known after apply)
      + session_affinity                = "GENERATED_COOKIE"
      + timeout_sec                     = 30

      + backend {
          + balancing_mode               = "UTILIZATION"
          + capacity_scaler              = 1
          + group                        = (known after apply)
          + max_connections              = (known after apply)
          + max_connections_per_endpoint = (known after apply)
          + max_connections_per_instance = (known after apply)
          + max_rate                     = (known after apply)
          + max_rate_per_endpoint        = (known after apply)
          + max_rate_per_instance        = (known after apply)
          + max_utilization              = (known after apply)
            # (2 unchanged attributes hidden)
        }

      + cdn_policy (known after apply)

      + iap (known after apply)

      + log_config {
          + enable        = true
          + optional_mode = (known after apply)
          + sample_rate   = 1
        }
    }

  # module.load_balancer.google_compute_global_address.lb_ip will be created
  + resource "google_compute_global_address" "lb_ip" {
      + address            = (known after apply)
      + creation_timestamp = (known after apply)
      + description        = "Global IP for staging Load Balancer"
      + effective_labels   = {
          + "cost-center"                = "engineering"
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "hipaa"                      = "ready"
          + "managed-by"                 = "terraform"
        }
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + labels             = {
          + "cost-center" = "engineering"
          + "environment" = "staging"
          + "hipaa"       = "ready"
          + "managed-by"  = "terraform"
        }
      + name               = "adyela-staging-lb-ip"
      + prefix_length      = (known after apply)
      + project            = "adyela-staging"
      + self_link          = (known after apply)
      + terraform_labels   = {
          + "cost-center"                = "engineering"
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "hipaa"                      = "ready"
          + "managed-by"                 = "terraform"
        }
    }

  # module.load_balancer.google_compute_global_forwarding_rule.web_http_forwarding_rule will be created
  + resource "google_compute_global_forwarding_rule" "web_http_forwarding_rule" {
      + base_forwarding_rule  = (known after apply)
      + effective_labels      = (known after apply)
      + forwarding_rule_id    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "adyela-staging-web-http-forwarding-rule"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "80"
      + project               = "adyela-staging"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)

      + service_directory_registrations (known after apply)
    }

  # module.load_balancer.google_compute_global_forwarding_rule.web_https_forwarding_rule will be created
  + resource "google_compute_global_forwarding_rule" "web_https_forwarding_rule" {
      + base_forwarding_rule  = (known after apply)
      + effective_labels      = (known after apply)
      + forwarding_rule_id    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + label_fingerprint     = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "adyela-staging-web-https-forwarding-rule"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "443"
      + project               = "adyela-staging"
      + psc_connection_id     = (known after apply)
      + psc_connection_status = (known after apply)
      + self_link             = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
      + terraform_labels      = (known after apply)

      + service_directory_registrations (known after apply)
    }

  # module.load_balancer.google_compute_health_check.api_health_check will be created
  + resource "google_compute_health_check" "api_health_check" {
      + check_interval_sec  = 10
      + creation_timestamp  = (known after apply)
      + description         = "Health check for staging API service"
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "adyela-staging-api-health-check"
      + project             = "adyela-staging"
      + self_link           = (known after apply)
      + timeout_sec         = 5
      + type                = (known after apply)
      + unhealthy_threshold = 3

      + http_health_check {
          + port         = 8000
          + proxy_header = "NONE"
          + request_path = "/health"
        }

      + log_config (known after apply)
    }

  # module.load_balancer.google_compute_health_check.web_health_check will be created
  + resource "google_compute_health_check" "web_health_check" {
      + check_interval_sec  = 10
      + creation_timestamp  = (known after apply)
      + description         = "Health check for staging web service"
      + healthy_threshold   = 2
      + id                  = (known after apply)
      + name                = "adyela-staging-web-health-check"
      + project             = "adyela-staging"
      + self_link           = (known after apply)
      + timeout_sec         = 5
      + type                = (known after apply)
      + unhealthy_threshold = 3

      + http_health_check {
          + port         = 8080
          + proxy_header = "NONE"
          + request_path = "/"
        }

      + log_config (known after apply)
    }

  # module.load_balancer.google_compute_managed_ssl_certificate.web_ssl_cert will be created
  + resource "google_compute_managed_ssl_certificate" "web_ssl_cert" {
      + certificate_id            = (known after apply)
      + creation_timestamp        = (known after apply)
      + expire_time               = (known after apply)
      + id                        = (known after apply)
      + name                      = "adyela-staging-web-ssl-cert"
      + project                   = "adyela-staging"
      + self_link                 = (known after apply)
      + subject_alternative_names = (known after apply)
      + type                      = "MANAGED"

      + managed {
          + domains = [
              + "staging.adyela.care",
              + "api.staging.adyela.care",
            ]
        }
    }

  # module.load_balancer.google_compute_region_network_endpoint_group.api_neg will be created
  + resource "google_compute_region_network_endpoint_group" "api_neg" {
      + id                    = (known after apply)
      + name                  = "adyela-staging-api-neg"
      + network_endpoint_type = "SERVERLESS"
      + project               = "adyela-staging"
      + region                = "us-central1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "adyela-api-staging"
        }

      + psc_data (known after apply)
    }

  # module.load_balancer.google_compute_region_network_endpoint_group.cloud_run_neg will be created
  + resource "google_compute_region_network_endpoint_group" "cloud_run_neg" {
      + id                    = (known after apply)
      + name                  = "adyela-staging-cloud-run-neg"
      + network_endpoint_type = "SERVERLESS"
      + project               = "adyela-staging"
      + region                = "us-central1"
      + self_link             = (known after apply)

      + cloud_run {
          + service = "adyela-web-staging"
        }

      + psc_data (known after apply)
    }

  # module.load_balancer.google_compute_target_http_proxy.web_http_proxy will be created
  + resource "google_compute_target_http_proxy" "web_http_proxy" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + name               = "adyela-staging-web-http-proxy"
      + project            = "adyela-staging"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + self_link          = (known after apply)
      + url_map            = (known after apply)
    }

  # module.load_balancer.google_compute_target_https_proxy.web_https_proxy will be created
  + resource "google_compute_target_https_proxy" "web_https_proxy" {
      + creation_timestamp = (known after apply)
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + name               = "adyela-staging-web-https-proxy"
      + project            = "adyela-staging"
      + proxy_bind         = (known after apply)
      + proxy_id           = (known after apply)
      + quic_override      = "NONE"
      + self_link          = (known after apply)
      + ssl_certificates   = (known after apply)
      + tls_early_data     = (known after apply)
      + url_map            = (known after apply)
    }

  # module.load_balancer.google_compute_url_map.web_url_map will be created
  + resource "google_compute_url_map" "web_url_map" {
      + creation_timestamp = (known after apply)
      + default_service    = (known after apply)
      + description        = "URL map for staging web application"
      + fingerprint        = (known after apply)
      + id                 = (known after apply)
      + map_id             = (known after apply)
      + name               = "adyela-staging-web-url-map"
      + project            = "adyela-staging"
      + self_link          = (known after apply)

      + host_rule {
          + hosts        = [
              + "api.staging.adyela.care",
              + "staging.adyela.care",
            ]
          + path_matcher = "allpaths"
            # (1 unchanged attribute hidden)
        }

      + path_matcher {
          + default_service = (known after apply)
          + name            = "allpaths"

          + path_rule {
              + paths   = [
                  + "/health",
                  + "/readiness",
                ]
              + service = (known after apply)
            }
          + path_rule {
              + paths   = [
                  + "/api/*",
                ]
              + service = (known after apply)
            }
        }
    }

  # module.load_balancer.google_storage_bucket.static_assets will be created
  + resource "google_storage_bucket" "static_assets" {
      + effective_labels            = {
          + "cost-center"                = "engineering"
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "hipaa"                      = "ready"
          + "managed-by"                 = "terraform"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "cost-center" = "engineering"
          + "environment" = "staging"
          + "hipaa"       = "ready"
          + "managed-by"  = "terraform"
        }
      + location                    = "US-CENTRAL1"
      + name                        = "adyela-staging-static-assets"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = "unspecified"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "cost-center"                = "engineering"
          + "environment"                = "staging"
          + "goog-terraform-provisioned" = "true"
          + "hipaa"                      = "ready"
          + "managed-by"                 = "terraform"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + cors {
          + max_age_seconds = 3600
          + method          = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + origin          = [
              + "https://staging.adyela.care",
              + "https://api.staging.adyela.care",
            ]
          + response_header = [
              + "*",
            ]
        }

      + lifecycle_rule {
          + action {
              + type          = "Delete"
                # (1 unchanged attribute hidden)
            }
          + condition {
              + age                    = 30
              + matches_prefix         = []
              + matches_storage_class  = []
              + matches_suffix         = []
              + with_state             = (known after apply)
                # (3 unchanged attributes hidden)
            }
        }

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.load_balancer.google_storage_bucket_iam_member.static_assets_public will be created
  + resource "google_storage_bucket_iam_member" "static_assets_public" {
      + bucket = "adyela-staging-static-assets"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "allUsers"
      + role   = "roles/storage.objectViewer"
    }

  # module.monitoring.google_monitoring_alert_policy.api_downtime will be created
  + resource "google_monitoring_alert_policy" "api_downtime" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "adyela-staging-api-downtime"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "adyela-staging"

      + alert_strategy {
          + auto_close = "1800s"
        }

      + conditions {
          + display_name = "API Health Check Failure"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_LT"
              + duration        = "60s"
              + filter          = "resource.type=\"uptime_url\" AND metric.type=\"monitoring.googleapis.com/uptime_check/check_passed\" AND resource.labels.host=\"api.staging.adyela.care\""
              + threshold_value = 1

              + aggregations {
                  + alignment_period   = "60s"
                  + per_series_aligner = "ALIGN_FRACTION_TRUE"
                }
            }
        }

      + documentation {
          + content   = <<-EOT
                ## API Health Check Failure
                
                **Service**: adyela API (staging)
                **Endpoint**: https://api.staging.adyela.care/health
                
                ### Immediate Actions:
                1. Check API logs: `gcloud logging read "resource.labels.service_name=adyela-api-staging" --limit=50`
                2. Check Cloud Run status: `gcloud run services describe adyela-api-staging --region=us-central1`
                3. Verify Load Balancer health: GCP Console → Network Services → Load Balancing
                
                ### Escalation:
                - If downtime >5 minutes: Page on-call engineer
                - If downtime >15 minutes: Notify leadership
                
                ### Recovery:
                - Check recent deployments: `gcloud run revisions list --service=adyela-api-staging`
                - Rollback if needed: `gcloud run services update-traffic adyela-api-staging --to-revisions=PREVIOUS_REVISION=100`
            EOT
          + mime_type = "text/markdown"
        }
    }

  # module.monitoring.google_monitoring_alert_policy.high_error_rate will be created
  + resource "google_monitoring_alert_policy" "high_error_rate" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "adyela-staging-high-error-rate"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "adyela-staging"

      + conditions {
          + display_name = "API Error Rate >1%"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"adyela-api-staging\" AND metric.type=\"run.googleapis.com/request_count\" AND metric.labels.response_code_class!=\"2xx\""
              + threshold_value = 0.01

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_SUM"
                  + group_by_fields      = [
                      + "resource.service_name",
                    ]
                  + per_series_aligner   = "ALIGN_RATE"
                }
            }
        }

      + documentation {
          + content   = <<-EOT
                ## High API Error Rate Detected
                
                The API is returning >1% errors in the last 5 minutes.
                
                ### Check:
                1. Recent error logs: `gcloud logging read "resource.labels.service_name=adyela-api-staging AND severity>=ERROR" --limit=20`
                2. Error distribution by endpoint
                3. Recent code deployments
            EOT
          + mime_type = "text/markdown"
        }
    }

  # module.monitoring.google_monitoring_alert_policy.high_latency will be created
  + resource "google_monitoring_alert_policy" "high_latency" {
      + combiner              = "OR"
      + creation_record       = (known after apply)
      + display_name          = "adyela-staging-high-latency"
      + enabled               = true
      + id                    = (known after apply)
      + name                  = (known after apply)
      + notification_channels = (known after apply)
      + project               = "adyela-staging"

      + conditions {
          + display_name = "API Latency P95 >1000ms"
          + name         = (known after apply)

          + condition_threshold {
              + comparison      = "COMPARISON_GT"
              + duration        = "300s"
              + filter          = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"adyela-api-staging\" AND metric.type=\"run.googleapis.com/request_latencies\""
              + threshold_value = 1000

              + aggregations {
                  + alignment_period     = "60s"
                  + cross_series_reducer = "REDUCE_PERCENTILE_95"
                  + group_by_fields      = [
                      + "resource.service_name",
                    ]
                  + per_series_aligner   = "ALIGN_DELTA"
                }
            }
        }

      + documentation {
          + content   = "API latency P95 is above 1 second. Check Cloud Run metrics and database performance."
          + mime_type = "text/markdown"
        }
    }

  # module.monitoring.google_monitoring_custom_service.api_service will be created
  + resource "google_monitoring_custom_service" "api_service" {
      + display_name = "Adyela API (staging)"
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "adyela-staging"
      + service_id   = "adyela-api-staging"

      + telemetry {
          + resource_name = "//run.googleapis.com/projects/adyela-staging/locations/us-central1/services/adyela-api-staging"
        }
    }

  # module.monitoring.google_monitoring_dashboard.main_dashboard will be created
  + resource "google_monitoring_dashboard" "main_dashboard" {
      + dashboard_json = jsonencode(
            {
              + displayName  = "adyela staging - Main Dashboard"
              + mosaicLayout = {
                  + columns = 12
                  + tiles   = [
                      + {
                          + height = 4
                          + widget = {
                              + title   = "API Request Rate"
                              + xyChart = {
                                  + dataSets = [
                                      + {
                                          + timeSeriesQuery = {
                                              + timeSeriesFilter = {
                                                  + aggregation = {
                                                      + alignmentPeriod  = "60s"
                                                      + perSeriesAligner = "ALIGN_RATE"
                                                    }
                                                  + filter      = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"adyela-api-staging\" AND metric.type=\"run.googleapis.com/request_count\""
                                                }
                                            }
                                        },
                                    ]
                                }
                            }
                          + width  = 6
                        },
                      + {
                          + height = 4
                          + widget = {
                              + title   = "Error Rate (%)"
                              + xyChart = {
                                  + dataSets = [
                                      + {
                                          + timeSeriesQuery = {
                                              + timeSeriesFilter = {
                                                  + aggregation = {
                                                      + alignmentPeriod    = "60s"
                                                      + crossSeriesReducer = "REDUCE_SUM"
                                                      + perSeriesAligner   = "ALIGN_RATE"
                                                    }
                                                  + filter      = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"adyela-api-staging\" AND metric.type=\"run.googleapis.com/request_count\" AND metric.labels.response_code_class!=\"2xx\""
                                                }
                                            }
                                        },
                                    ]
                                }
                            }
                          + width  = 6
                          + xPos   = 6
                        },
                      + {
                          + height = 4
                          + widget = {
                              + title   = "Request Latency (P50, P95, P99)"
                              + xyChart = {
                                  + dataSets = [
                                      + {
                                          + plotType        = "LINE"
                                          + targetAxis      = "Y1"
                                          + timeSeriesQuery = {
                                              + timeSeriesFilter = {
                                                  + aggregation = {
                                                      + alignmentPeriod    = "60s"
                                                      + crossSeriesReducer = "REDUCE_PERCENTILE_50"
                                                      + perSeriesAligner   = "ALIGN_DELTA"
                                                    }
                                                  + filter      = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"adyela-api-staging\" AND metric.type=\"run.googleapis.com/request_latencies\""
                                                }
                                            }
                                        },
                                      + {
                                          + plotType        = "LINE"
                                          + targetAxis      = "Y1"
                                          + timeSeriesQuery = {
                                              + timeSeriesFilter = {
                                                  + aggregation = {
                                                      + alignmentPeriod    = "60s"
                                                      + crossSeriesReducer = "REDUCE_PERCENTILE_95"
                                                      + perSeriesAligner   = "ALIGN_DELTA"
                                                    }
                                                  + filter      = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"adyela-api-staging\" AND metric.type=\"run.googleapis.com/request_latencies\""
                                                }
                                            }
                                        },
                                      + {
                                          + plotType        = "LINE"
                                          + targetAxis      = "Y1"
                                          + timeSeriesQuery = {
                                              + timeSeriesFilter = {
                                                  + aggregation = {
                                                      + alignmentPeriod    = "60s"
                                                      + crossSeriesReducer = "REDUCE_PERCENTILE_99"
                                                      + perSeriesAligner   = "ALIGN_DELTA"
                                                    }
                                                  + filter      = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"adyela-api-staging\" AND metric.type=\"run.googleapis.com/request_latencies\""
                                                }
                                            }
                                        },
                                    ]
                                }
                            }
                          + width  = 12
                          + yPos   = 4
                        },
                    ]
                }
            }
        )
      + id             = (known after apply)
      + project        = "adyela-staging"
    }

  # module.monitoring.google_monitoring_notification_channel.email_alerts will be created
  + resource "google_monitoring_notification_channel" "email_alerts" {
      + display_name        = "adyela-staging-email-alerts"
      + enabled             = true
      + force_delete        = false
      + id                  = (known after apply)
      + labels              = {
          + "email_address" = "hever_gonzalezg@adyela.care"
        }
      + name                = (known after apply)
      + project             = "adyela-staging"
      + type                = "email"
      + verification_status = (known after apply)
    }

  # module.monitoring.google_monitoring_slo.api_availability will be created
  + resource "google_monitoring_slo" "api_availability" {
      + display_name        = "API Availability SLO (99.9%)"
      + goal                = 0.999
      + id                  = (known after apply)
      + name                = (known after apply)
      + project             = "adyela-staging"
      + rolling_period_days = 30
      + service             = "adyela-api-staging"
      + slo_id              = "api-availability-slo"

      + request_based_sli {
          + good_total_ratio {
              + good_service_filter  = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"adyela-api-staging\" AND metric.type=\"run.googleapis.com/request_count\" AND metric.labels.response_code_class=\"2xx\""
              + total_service_filter = "resource.type=\"cloud_run_revision\" AND resource.labels.service_name=\"adyela-api-staging\" AND metric.type=\"run.googleapis.com/request_count\""
            }
        }
    }

  # module.monitoring.google_monitoring_uptime_check_config.api_health will be created
  + resource "google_monitoring_uptime_check_config" "api_health" {
      + checker_type     = "STATIC_IP_CHECKERS"
      + display_name     = "adyela-staging-api-uptime"
      + id               = (known after apply)
      + name             = (known after apply)
      + period           = "60s"
      + project          = "adyela-staging"
      + selected_regions = [
          + "USA",
          + "EUROPE",
          + "SOUTH_AMERICA",
        ]
      + timeout          = "10s"
      + uptime_check_id  = (known after apply)

      + http_check {
          + headers        = (known after apply)
          + path           = "/health"
          + port           = 443
          + request_method = "GET"
          + use_ssl        = true
          + validate_ssl   = true

          + accepted_response_status_codes {
              + status_class = "STATUS_CLASS_2XX"
            }
        }

      + monitored_resource {
          + labels = {
              + "host"       = "api.staging.adyela.care"
              + "project_id" = "adyela-staging"
            }
          + type   = "uptime_url"
        }
    }

  # module.monitoring.google_monitoring_uptime_check_config.web_homepage will be created
  + resource "google_monitoring_uptime_check_config" "web_homepage" {
      + checker_type     = "STATIC_IP_CHECKERS"
      + display_name     = "adyela-staging-web-uptime"
      + id               = (known after apply)
      + name             = (known after apply)
      + period           = "300s"
      + project          = "adyela-staging"
      + selected_regions = [
          + "USA",
          + "EUROPE",
        ]
      + timeout          = "10s"
      + uptime_check_id  = (known after apply)

      + http_check {
          + headers        = (known after apply)
          + path           = "/"
          + port           = 443
          + request_method = "GET"
          + use_ssl        = true
          + validate_ssl   = true

          + accepted_response_status_codes {
              + status_class = "STATUS_CLASS_2XX"
            }
        }

      + monitored_resource {
          + labels = {
              + "host"       = "staging.adyela.care"
              + "project_id" = "adyela-staging"
            }
          + type   = "uptime_url"
        }
    }

  # module.service_account.google_project_iam_member.artifact_registry_reader will be created
  + resource "google_project_iam_member" "artifact_registry_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
      + project = "adyela-staging"
      + role    = "roles/artifactregistry.reader"
    }

  # module.service_account.google_project_iam_member.cloudsql_client will be created
  + resource "google_project_iam_member" "cloudsql_client" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
      + project = "adyela-staging"
      + role    = "roles/cloudsql.client"
    }

  # module.service_account.google_project_iam_member.datastore_user will be created
  + resource "google_project_iam_member" "datastore_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
      + project = "adyela-staging"
      + role    = "roles/datastore.user"
    }

  # module.service_account.google_project_iam_member.logging_writer will be created
  + resource "google_project_iam_member" "logging_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
      + project = "adyela-staging"
      + role    = "roles/logging.logWriter"
    }

  # module.service_account.google_project_iam_member.run_admin will be created
  + resource "google_project_iam_member" "run_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
      + project = "adyela-staging"
      + role    = "roles/run.admin"
    }

  # module.service_account.google_project_iam_member.secret_accessor will be created
  + resource "google_project_iam_member" "secret_accessor" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
      + project = "adyela-staging"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.service_account.google_project_iam_member.storage_object_viewer will be created
  + resource "google_project_iam_member" "storage_object_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
      + project = "adyela-staging"
      + role    = "roles/storage.objectViewer"
    }

  # module.service_account.google_service_account.hipaa will be created
  + resource "google_service_account" "hipaa" {
      + account_id   = "adyela-staging-hipaa"
      + description  = "Dedicated service account for HIPAA-compliant staging deployments"
      + disabled     = false
      + display_name = "Adyela Staging HIPAA Service Account"
      + email        = "adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:adyela-staging-hipaa@adyela-staging.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "adyela-staging"
      + unique_id    = (known after apply)
    }

  # module.vpc.google_compute_firewall.allow_health_checks will be created
  + resource "google_compute_firewall" "allow_health_checks" {
      + creation_timestamp = (known after apply)
      + description        = "Allow health checks from Google Load Balancers"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "adyela-staging-vpc-allow-health-checks"
      + network            = "adyela-staging-vpc"
      + priority           = 1000
      + project            = "adyela-staging"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "130.211.0.0/22",
          + "35.191.0.0/16",
        ]

      + allow {
          + ports    = [
              + "80",
              + "443",
              + "8000",
              + "8080",
            ]
          + protocol = "tcp"
        }
    }

  # module.vpc.google_compute_firewall.allow_iap_ssh will be created
  + resource "google_compute_firewall" "allow_iap_ssh" {
      + creation_timestamp = (known after apply)
      + description        = "Allow SSH from Identity-Aware Proxy"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "adyela-staging-vpc-allow-iap-ssh"
      + network            = "adyela-staging-vpc"
      + priority           = 1000
      + project            = "adyela-staging"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "35.235.240.0/20",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
    }

  # module.vpc.google_compute_firewall.allow_internal will be created
  + resource "google_compute_firewall" "allow_internal" {
      + creation_timestamp = (known after apply)
      + description        = "Allow all internal traffic within VPC"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "adyela-staging-vpc-allow-internal"
      + network            = "adyela-staging-vpc"
      + priority           = 1000
      + project            = "adyela-staging"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.0.0.0/24",
        ]

      + allow {
          + ports    = [
              + "0-65535",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = [
              + "0-65535",
            ]
          + protocol = "udp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # module.vpc.google_compute_firewall.deny_all_ingress will be created
  + resource "google_compute_firewall" "deny_all_ingress" {
      + creation_timestamp = (known after apply)
      + description        = "Deny all ingress traffic by default"
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "adyela-staging-vpc-deny-all-ingress"
      + network            = "adyela-staging-vpc"
      + priority           = 65534
      + project            = "adyela-staging"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + deny {
          + ports    = []
          + protocol = "all"
        }
    }

  # module.vpc.google_compute_network.vpc will be created
  + resource "google_compute_network" "vpc" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_default_routes_on_create           = false
      + description                               = "VPC for staging environment - HIPAA compliant"
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "adyela-staging-vpc"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id             

... (truncated)
```